## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # zentral_munki_script_check.mcs-auditing-audit_acls_files_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-auditing-audit_acls_files_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 127
        name             = "[mSCP] - Auditing - Configure Audit Log Files to Not Contain Access Control Lists"
      ~ source           = "/bin/ls -le $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \\\":\\\"" -> "/bin/ls -le $(/usr/bin/grep '^dir' /etc/security/audit_control | /usr/bin/awk -F: '{print $2}') | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-auditing-audit_acls_folders_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-auditing-audit_acls_folders_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 70
        name             = "[mSCP] - Auditing - Configure Audit Log Folder to Not Contain Access Control Lists"
      ~ source           = "/bin/ls -lde /var/audit | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \\\":\\\"" -> "/bin/ls -lde /var/audit | /usr/bin/awk '{print $1}' | /usr/bin/grep -c \":\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-auditing-audit_auditd_enabled will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-auditing-audit_auditd_enabled" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 96
        name             = "[mSCP] - Auditing - Enable Security Auditing"
      ~ source           = <<-EOT
            LAUNCHD_RUNNING=$(/bin/launchctl list | /usr/bin/grep -c com.apple.auditd)
          - AUDITD_RUNNING=$(/usr/sbin/audit -c | /usr/bin/grep -c \"AUC_AUDITING\")
          + AUDITD_RUNNING=$(/usr/sbin/audit -c | /usr/bin/grep -c "AUC_AUDITING")
            if [[ $LAUNCHD_RUNNING == 1 ]] && [[ -e /etc/security/audit_control ]] && [[ $AUDITD_RUNNING == 1 ]]; then
          -   echo \"pass\"
          +   echo "pass"
            else
          -   echo \"fail\"
          +   echo "fail"
            fi
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-auditing-audit_settings_failure_notify will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-auditing-audit_settings_failure_notify" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 7
        name             = "[mSCP] - Auditing - Configure Audit Failure Notification"
      ~ source           = "/usr/bin/grep -c \\\"logger -s -p\\\" /etc/security/audit_warn" -> "/usr/bin/grep -c \"logger -s -p\" /etc/security/audit_warn"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-icloud-icloud_appleid_system_settings_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-icloud-icloud_appleid_system_settings_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 1
        name             = "[mSCP] - iCloud - Disable the System Setting for Apple ID"
      ~ source           = "/usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()=\\\"DisabledSystemSettings\\\"]/following-sibling::*[1]' - | /usr/bin/grep -c \\\"com.apple.systempreferences.AppleIDSettings\\\"" -> "/usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()=\"DisabledSystemSettings\"]/following-sibling::*[1]' - | /usr/bin/grep -c \"com.apple.systempreferences.AppleIDSettings\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_certificate_authority_trust will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_certificate_authority_trust" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 131
        name             = "[mSCP] - macOS - Issue or Obtain Public Key Certificates from an Approved Service Provider"
      ~ source           = "/usr/bin/security dump-keychain /Library/Keychains/System.keychain | /usr/bin/awk -F'\\\"' '/labl/ {print $4}'" -> "/usr/bin/security dump-keychain /Library/Keychains/System.keychain | /usr/bin/awk -F'\"' '/labl/ {print $4}'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_firewall_default_deny_require will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_firewall_default_deny_require" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 22
        name             = "[mSCP] - macOS - Control Connections to Other Systems via a Deny-All and Allow-by-Exception Firewall Policy"
      ~ source           = "/sbin/pfctl -a '*' -sr &> /dev/null | /usr/bin/grep -c \\\"block drop in all\\\"" -> "/sbin/pfctl -a '*' -sr &> /dev/null | /usr/bin/grep -c \"block drop in all\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_firewall_log_enable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_firewall_log_enable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 121
        name             = "[mSCP] - macOS - Enable Firewall Logging"
      ~ source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            function run() {
              let pref1 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
              .objectForKey('EnableLogging').js
              let pref2 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
              .objectForKey('LoggingOption').js
          -   if ( pref1 == true && pref2 == \"detail\" ){
          +   if ( pref1 == true && pref2 == "detail" ){
          -     return(\"true\")
          +     return("true")
              } else {
          -     return(\"false\")
          +     return("false")
              }
            }
            EOS
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_firmware_password_require will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_firmware_password_require" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 147
        name             = "[mSCP] - macOS - Enable Firmware Password"
      ~ source           = "/usr/sbin/firmwarepasswd -check | /usr/bin/grep -c \\\"Password Enabled: Yes\\\"" -> "/usr/sbin/firmwarepasswd -check | /usr/bin/grep -c \"Password Enabled: Yes\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_gatekeeper_enable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_gatekeeper_enable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 138
        name             = "[mSCP] - macOS - Enable Gatekeeper"
      ~ source           = "/usr/sbin/spctl --status | /usr/bin/grep -c \\\"assessments enabled\\\"" -> "/usr/sbin/spctl --status | /usr/bin/grep -c \"assessments enabled\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_home_folders_secure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_home_folders_secure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 120
        name             = "[mSCP] - macOS - Secure User's Home Folders"
      ~ source           = "/usr/bin/find /System/Volumes/Data/Users -mindepth 1 -maxdepth 1 -type d ! \\( -perm 700 -o -perm 711 \\) | /usr/bin/grep -v \\\"Shared\\\" | /usr/bin/grep -v \\\"Guest\\\" | /usr/bin/wc -l | /usr/bin/xargs" -> "/usr/bin/find /System/Volumes/Data/Users -mindepth 1 -maxdepth 1 -type d ! \\( -perm 700 -o -perm 711 \\) | /usr/bin/grep -v \"Shared\" | /usr/bin/grep -v \"Guest\" | /usr/bin/wc -l | /usr/bin/xargs"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_httpd_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_httpd_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 31
        name             = "[mSCP] - macOS - Disable the Built-in Web Server"
      ~ source           = "/bin/launchctl print-disabled system | /usr/bin/grep -c '\\\"org.apache.httpd\\\" => disabled'" -> "/bin/launchctl print-disabled system | /usr/bin/grep -c '\"org.apache.httpd\" => disabled'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_mdm_require will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_mdm_require" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 95
        name             = "[mSCP] - macOS - Enforce Enrollment in Mobile Device Management"
      ~ source           = "/usr/bin/profiles status -type enrollment | /usr/bin/awk -F: '/MDM enrollment/ {print $2}' | /usr/bin/grep -c \\\"Yes (User Approved)\\\"" -> "/usr/bin/profiles status -type enrollment | /usr/bin/awk -F: '/MDM enrollment/ {print $2}' | /usr/bin/grep -c \"Yes (User Approved)\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_nfsd_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_nfsd_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 84
        name             = "[mSCP] - macOS - Disable Network File System Service"
      ~ source           = "/bin/launchctl print-disabled system | /usr/bin/grep -c '\\\"com.apple.nfsd\\\" => disabled'" -> "/bin/launchctl print-disabled system | /usr/bin/grep -c '\"com.apple.nfsd\" => disabled'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_policy_banner_ssh_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_policy_banner_ssh_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 75
        name             = "[mSCP] - macOS - Display Policy Banner at Remote Login"
      ~ source           = <<-EOT
          - bannerText=\"You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions:
          + bannerText="You are accessing a U.S. Government (USG) Information System (IS) that is provided for USG-authorized use only. By using this IS (which includes any device attached to this IS), you consent to the following conditions:
            -The USG routinely intercepts and monitors communications on this IS for purposes including, but not limited to, penetration testing, COMSEC monitoring, network operations and defense, personnel misconduct (PM), law enforcement (LE), and counterintelligence (CI) investigations.
            -At any time, the USG may inspect and seize data stored on this IS.
            -Communications using, or data stored on, this IS are not private, are subject to routine monitoring, interception, and search, and may be disclosed or used for any USG authorized purpose.
            -This IS includes security measures (e.g., authentication and access controls) to protect USG interests--not for your personal benefit or privacy.
          - -Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details.\"
          + -Notwithstanding the above, using this IS does not constitute consent to PM, LE or CI investigative searching or monitoring of the content of privileged communications, or work product, related to personal representation or services by attorneys, psychotherapists, or clergy, and their assistants. Such communications and work product are private and confidential. See User Agreement for details."
          - test \"$(cat /etc/banner)\" = \"$bannerText\" && echo \"1\" || echo \"0\"
          + test "$(cat /etc/banner)" = "$bannerText" && echo "1" || echo "0"
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_policy_banner_ssh_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_policy_banner_ssh_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 12
        name             = "[mSCP] - macOS - Enforce SSH to Display Policy Banner"
      ~ source           = "/usr/sbin/sshd -G | /usr/bin/grep -c \\\"^banner /etc/banner\\\"" -> "/usr/sbin/sshd -G | /usr/bin/grep -c \"^banner /etc/banner\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_recovery_lock_enable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_recovery_lock_enable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 27
        name             = "[mSCP] - macOS - Enable Recovery Lock"
      ~ source           = "/usr/libexec/mdmclient QuerySecurityInfo | /usr/bin/grep -c \\\"IsRecoveryLockEnabled = 1\\\"" -> "/usr/libexec/mdmclient QuerySecurityInfo | /usr/bin/grep -c \"IsRecoveryLockEnabled = 1\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_root_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_root_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 134
        name             = "[mSCP] - macOS - Disable Root Login"
      ~ source           = "/usr/bin/dscl . -read /Users/root UserShell 2>&1 | /usr/bin/grep -c \\\"/usr/bin/false\\\"" -> "/usr/bin/dscl . -read /Users/root UserShell 2>&1 | /usr/bin/grep -c \"/usr/bin/false\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_secure_boot_verify will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_secure_boot_verify" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 103
        name             = "[mSCP] - macOS - Ensure Secure Boot Level Set to Full"
      ~ source           = "/usr/libexec/mdmclient QuerySecurityInfo | /usr/bin/grep -c \\\"SecureBootLevel = full\\\"" -> "/usr/libexec/mdmclient QuerySecurityInfo | /usr/bin/grep -c \"SecureBootLevel = full\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_ssh_fips_compliant will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_ssh_fips_compliant" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 56
        name             = "[mSCP] - macOS - Limit SSH to FIPS Compliant Connections"
      ~ source           = <<-EOT
          - fips_ssh_config=\"Host *
          + fips_ssh_config="Host *
            Ciphers aes128-gcm@openssh.com
            HostbasedAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
            HostKeyAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
            KexAlgorithms ecdh-sha2-nistp256
            MACs hmac-sha2-256
            PubkeyAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
          - CASignatureAlgorithms ecdsa-sha2-nistp256\"
          + CASignatureAlgorithms ecdsa-sha2-nistp256"
          - /usr/bin/grep -c \"$fips_ssh_config\" /etc/ssh/ssh_config.d/fips_ssh_config
          + /usr/bin/grep -c "$fips_ssh_config" /etc/ssh/ssh_config.d/fips_ssh_config
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_ssh_server_alive_count_max_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_ssh_server_alive_count_max_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 54
        name             = "[mSCP] - macOS - Set SSH Active Server Alive Maximum to 0"
      ~ source           = <<-EOT
          - ret=\"pass\"
          + ret="pass"
            for u in $(/usr/bin/dscl . -list /Users UniqueID | /usr/bin/awk '$2 > 500 {print $1}'); do
          -   sshCheck=$(/usr/bin/sudo -u $u /usr/bin/ssh -G . | /usr/bin/grep -c \"^serveralivecountmax 0\")
          +   sshCheck=$(/usr/bin/sudo -u $u /usr/bin/ssh -G . | /usr/bin/grep -c "^serveralivecountmax 0")
          -   if [[ \"$sshCheck\" == \"0\" ]]; then
          +   if [[ "$sshCheck" == "0" ]]; then
          -     ret=\"fail\"
          +     ret="fail"
                break
              fi
            done
            /bin/echo $ret
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_ssh_server_alive_interval_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_ssh_server_alive_interval_configure" {
      ~ description      = <<-EOT
          - SSH _MUST_ be configured with an Active Server Alive Maximum Count set to 654.
          + SSH _MUST_ be configured with an Active Server Alive Maximum Count set to 900.
            
          - Setting the Active Server Alive Maximum Count to 654 will log users out after a 654 seconds interval of inactivity.
          + Setting the Active Server Alive Maximum Count to 900 will log users out after a 900 seconds interval of inactivity.
            
            NOTE: /etc/ssh/ssh_config will be automatically modified to its original state following any update or major upgrade to the operating system.
        EOT
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 99
      ~ name             = "[mSCP] - macOS - Configure SSH ServerAliveInterval option set to 654" -> "[mSCP] - macOS - Configure SSH ServerAliveInterval option set to 900"
      ~ source           = <<-EOT
          - ret=\"pass\"
          + ret="pass"
            for u in $(/usr/bin/dscl . -list /Users UniqueID | /usr/bin/awk '$2 > 500 {print $1}'); do
          -   sshCheck=$(/usr/bin/sudo -u $u /usr/bin/ssh -G . | /usr/bin/grep -c \"^serveraliveinterval 654\")
          +   sshCheck=$(/usr/bin/sudo -u $u /usr/bin/ssh -G . | /usr/bin/grep -c "^serveraliveinterval 900")
          -   if [[ \"$sshCheck\" == \"0\" ]]; then
          +   if [[ "$sshCheck" == "0" ]]; then
          -     ret=\"fail\"
          +     ret="fail"
                break
              fi
            done
            /bin/echo $ret
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_sshd_channel_timeout_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_sshd_channel_timeout_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 156
        name             = "[mSCP] - macOS - Configure SSHD Channel Timeout to 900"
      ~ source           = "/usr/sbin/sshd -G | /usr/bin/awk -F \\\"=\\\" '/channeltimeout session:*/{print $2}'" -> "/usr/sbin/sshd -G | /usr/bin/awk -F \"=\" '/channeltimeout session:*/{print $2}'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_sshd_fips_compliant will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_sshd_fips_compliant" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 94
        name             = "[mSCP] - macOS - Limit SSHD to FIPS Compliant Connections"
      ~ source           = <<-EOT
          - fips_sshd_config=(\"Ciphers aes128-gcm@openssh.com\" \"HostbasedAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com\" \"HostKeyAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com\" \"KexAlgorithms ecdh-sha2-nistp256\" \"MACs hmac-sha2-256\" \"PubkeyAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com\" \"CASignatureAlgorithms ecdsa-sha2-nistp256\")
          + fips_sshd_config=("Ciphers aes128-gcm@openssh.com" "HostbasedAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com" "HostKeyAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com" "KexAlgorithms ecdh-sha2-nistp256" "MACs hmac-sha2-256" "PubkeyAcceptedAlgorithms ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com" "CASignatureAlgorithms ecdsa-sha2-nistp256")
            total=0
            for config in $fips_sshd_config; do
          -   total=$(expr $(/usr/sbin/sshd -G | /usr/bin/grep -i -c \"$config\") + $total)
          +   total=$(expr $(/usr/sbin/sshd -G | /usr/bin/grep -i -c "$config") + $total)
            done
            
            echo $total
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_sudo_timeout_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_sudo_timeout_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 116
        name             = "[mSCP] - macOS - Configure Sudo Timeout Period to 0"
      ~ source           = "/usr/bin/sudo /usr/bin/sudo -V | /usr/bin/grep -c \\\"Authentication timestamp timeout: 0.0 minutes\\\"" -> "/usr/bin/sudo /usr/bin/sudo -V | /usr/bin/grep -c \"Authentication timestamp timeout: 0.0 minutes\""
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_sudoers_timestamp_type_configure will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_sudoers_timestamp_type_configure" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 52
        name             = "[mSCP] - macOS - Configure Sudoers Timestamp Type"
      ~ source           = "/usr/bin/sudo /usr/bin/sudo -V | /usr/bin/awk -F\\\": \\\" '/Type of authentication timestamp record/{print $2}'" -> "/usr/bin/sudo /usr/bin/sudo -V | /usr/bin/awk -F\": \" '/Type of authentication timestamp record/{print $2}'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_tftpd_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_tftpd_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 10
        name             = "[mSCP] - macOS - Disable Trivial File Transfer Protocol Service"
      ~ source           = "/bin/launchctl print-disabled system | /usr/bin/grep -c '\\\"com.apple.tftpd\\\" => disabled'" -> "/bin/launchctl print-disabled system | /usr/bin/grep -c '\"com.apple.tftpd\" => disabled'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-macos-os_uucp_disable will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-macos-os_uucp_disable" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 93
        name             = "[mSCP] - macOS - Disable Unix-to-Unix Copy Protocol Service"
      ~ source           = "/bin/launchctl print-disabled system | /usr/bin/grep -c '\\\"com.apple.uucp\\\" => disabled'" -> "/bin/launchctl print-disabled system | /usr/bin/grep -c '\"com.apple.uucp\" => disabled'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_account_inactivity_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_account_inactivity_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 158
        name             = "[mSCP] - Password Policy - Disable Accounts after 35 Days of Inactivity"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyAttributeInactiveDays\\\"]/following-sibling::integer[1]/text()' -" -> "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\"policyAttributeInactiveDays\"]/following-sibling::integer[1]/text()' -"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_account_lockout_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_account_lockout_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 144
        name             = "[mSCP] - Password Policy - Limit Consecutive Failed Login Attempts to 3"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyAttributeMaximumFailedAuthentications\\\"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1 <= 3) {print \\\"yes\\\"} else {print \\\"no\\\"}}'" -> "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\"policyAttributeMaximumFailedAuthentications\"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1 <= 3) {print \"yes\"} else {print \"no\"}}'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_account_lockout_timeout_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_account_lockout_timeout_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 53
        name             = "[mSCP] - Password Policy - Set Account Lockout Time to 15 Minutes"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"autoEnableInSeconds\\\"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1/60 >= 15 ) {print \\\"yes\\\"} else {print \\\"no\\\"}}'" -> "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\"autoEnableInSeconds\"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1/60 >= 15 ) {print \"yes\"} else {print \"no\"}}'"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_alpha_numeric_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_alpha_numeric_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 3
        name             = "[mSCP] - Password Policy - Require Passwords Contain a Minimum of One Numeric Character"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyIdentifier\\\"]/following-sibling::*[1]/text()' - | /usr/bin/grep \\\"requireAlphanumeric\\\" -c" -> "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\"policyIdentifier\"]/following-sibling::*[1]/text()' - | /usr/bin/grep \"requireAlphanumeric\" -c"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_custom_regex_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_custom_regex_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 5
        name             = "[mSCP] - Password Policy - Require Passwords to Match the Defined Custom Regular Expression"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath 'boolean(//*[contains(text(),\\\"policyAttributePassword matches '\\''^(?=.*[A-Z])(?=.*[a-z]).*$'\\''\\\")])' -" -> "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath 'boolean(//*[contains(text(),\"policyAttributePassword matches '\\''^(?=.*[A-Z])(?=.*[a-z]).*$'\\''\")])' -"
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # zentral_munki_script_check.mcs-passwordpolicy-pwpolicy_history_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-passwordpolicy-pwpolicy_history_enforce" {
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 143
        name             = "[mSCP] - Password Policy - Prohibit Password Reuse for a Minimum of 5 Generations"
      ~ source           = "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()=\\\"policyAttributePasswordHistoryDepth\\\"]/following-sibling::*[1]/text()' - | /usr/bin/awk '{ if ($1 >= 5 ) {print
--- TRUNCATED ---
```
</details>